using BlazorMaga.Shared.Entities;

namespace BlazorMaga.Helpers
{
    public class RepositoryInMemory : IRepository
    {
        public List<Article> GetArticles()
        {
            var fullList = new List<Article>()
            {
                new Article()
                {
                    Id = 1,
                    Title = "Вступ до Джйотіш: що воно і навіщо?",
                    Picture = "images/img_1.jpg",
                    Created = new DateTime(2026, 3, 8, 0, 0, 0, DateTimeKind.Local),
                    Content = "Джйотіш, або індійська астрологія, є давньою системою астрологічного знання, що виникла в Індії тисячі років тому. Вона базується на вивченні руху планет і їх впливу на життя людини. Джйотіш допомагає людям зрозуміти свої сильні та слабкі сторони, а також передбачити майбутні події та можливості. У цьому вступному матеріалі ми розглянемо основи Джйотіш, його історію та практичне застосування в сучасному світі."
                },
                new Article()
                {
                    Id = 2,
                    Title = "Як Джйотіш допомагає в житті та бізнесі?",
                    Picture = "images/img_2.jpg",
                    Created = new DateTime(2026, 3, 9, 0, 0, 0, DateTimeKind.Local),
                    Content = "Джйотіш може бути корисним астрологічним інструментом для покращення якості життя та досягнення успіху в бізнесі. Він допомагає людям зрозуміти свої сильні та слабкі сторони, а також передбачити майбутні події та можливості. У бізнесі Джйотіш може допомогти у виборі сприятливого часу для запуску проектів, прийняття важливих рішень та управління ризиками. Використання Джйотіш може сприяти гармонії та процвітанню в особистому житті та професійній діяльності."
                },
                new Article()
                {
                    Id = 3,
                    Title = "Джйотіш для початківців: перші кроки...",
                    Picture = "images/img_3.jpg",
                    Created = new DateTime(2026, 3, 10, 0, 0, 0, DateTimeKind.Local),
                    Content = "Якщо ви зацікавилися Джйотіш і хочете розпочати вивчення цієї захоплюючої системи астрології, ось кілька перших кроків, які допоможуть вам почати. По-перше, знайдіть надійні джерела інформації, такі як книги, онлайн-курси або відео-уроки від досвідчених астрологів. По-друге, вивчіть основні поняття та терміни Джйотіш, такі як натальна карта, планети, знаки зодіаку та будинки. По-третє, практикуйте створення та аналіз натальних карт для себе та своїх близьких, щоб краще зрозуміти принципи Джйотіш на практиці."
                },
                new Article()
                {
                    Id = 4,
                    Title = "Джйотіш: натальна карта",
                    Picture = "images/img_4.jpg",
                    Created = new DateTime(2026, 4, 3, 0, 0, 0, DateTimeKind.Local),
                    Content = "Натальна карта, або гороскоп, є основним інструментом в Джйотіш. Вона створюється на основі дати, часу та місця народження людини і відображає розташування планет у момент її народження. Натальна карта допомагає астрологу зрозуміти характер, потенціал та життєвий шлях людини. Вона також може передбачити майбутні події та можливості, а також надати рекомендації щодо прийняття важливих рішень у житті."
                }
            };
            var sortedArticles = fullList.OrderByDescending(q => q.Created).Take(3).ToList();
            foreach (var article in sortedArticles)
            {
                article.isFirst = article.Id == sortedArticles.First().Id;
            }
            return sortedArticles;
        }

        public List<Article> GetALLArticles()
        {
            var fullList = new List<Article>()
            {
                new Article()
                {
                    Id = 1,
                    Title = "Вступ до Джйотіш: що воно і навіщо?",
                    Picture = "images/img_1.jpg",
                    Created = new DateTime(2026, 3, 8, 0, 0, 0, DateTimeKind.Local),
                    Content = "Джйотіш, або індійська астрологія, є давньою системою астрологічного знання, що виникла в Індії тисячі років тому. Вона базується на вивченні руху планет і їх впливу на життя людини. Джйотіш допомагає людям зрозуміти свої сильні та слабкі сторони, а також передбачити майбутні події та можливості. У цьому вступному матеріалі ми розглянемо основи Джйотіш, його історію та практичне застосування в сучасному світі."
                },
                new Article()
                {
                    Id = 2,
                    Title = "Як Джйотіш допомагає в житті та бізнесі?",
                    Picture = "images/img_2.jpg",
                    Created = new DateTime(2026, 3, 9, 0, 0, 0, DateTimeKind.Local),
                    Content = "Джйотіш може бути корисним астрологічним інструментом для покращення якості життя та досягнення успіху в бізнесі. Він допомагає людям зрозуміти свої сильні та слабкі сторони, а також передбачити майбутні події та можливості. У бізнесі Джйотіш може допомогти у виборі сприятливого часу для запуску проектів, прийняття важливих рішень та управління ризиками. Використання Джйотіш може сприяти гармонії та процвітанню в особистому житті та професійній діяльності."
                },
                new Article()
                {
                    Id = 3,
                    Title = "Джйотіш для початківців: перші кроки...",
                    Picture = "images/img_3.jpg",
                    Created = new DateTime(2026, 3, 10, 0, 0, 0, DateTimeKind.Local),
                    Content = "Якщо ви зацікавилися Джйотіш і хочете розпочати вивчення цієї захоплюючої системи астрології, ось кілька перших кроків, які допоможуть вам почати. По-перше, знайдіть надійні джерела інформації, такі як книги, онлайн-курси або відео-уроки від досвідчених астрологів. По-друге, вивчіть основні поняття та терміни Джйотіш, такі як натальна карта, планети, знаки зодіаку та будинки. По-третє, практикуйте створення та аналіз натальних карт для себе та своїх близьких, щоб краще зрозуміти принципи Джйотіш на практиці."
                },
                new Article()
                {
                    Id = 4,
                    Title = "Джйотіш: натальна карта",
                    Picture = "images/img_4.jpg",
                    Created = new DateTime(2026, 4, 3, 0, 0, 0, DateTimeKind.Local),
                    Content = "Натальна карта, або гороскоп, є основним інструментом в Джйотіш. Вона створюється на основі дати, часу та місця народження людини і відображає розташування планет у момент її народження. Натальна карта допомагає астрологу зрозуміти характер, потенціал та життєвий шлях людини. Вона також може передбачити майбутні події та можливості, а також надати рекомендації щодо прийняття важливих рішень у житті."
                }
            };
            var sortedArticles = fullList.OrderByDescending(q => q.Created).ToList();
            return sortedArticles;
        }
    }
}
